package by.tms.practice22;

public class Class {
//    Spring Boot, REST/REST API:
//    Тема: Сервисы
//    Если у нас есть сайт https://www.gismeteo.by, то введя https://www.gismeteo.by/api/ мы можем найти документацию для разработчиков
//    Мы до сих пор писали веб приложения (server-side HTML application).
//    Веб приложение - это клиент серверное приложение у которого клиент в 99% случае - браузер.
//    Поэтому мы всегда отдавали назад HTML - язык гипертекстовой разметки, который понимает сам браузер. Но дэсктопные приложения не браузер и им тоже нужно получать данные. И если gismeteo.by не имело бы никакого api, то  gismeteo.by будет отдавать HTML, а десктопное приложение этого не понимает.
//    Если веб приложение - это клиент-сервер и бэк всегда отдает клиенту HTML, то сервис - это слежебная программа в сети интернет, которая по запросу отдает не HTML, а какие-то данные
//    в каком-то виде
//    Теперь мы пишем приложения, которые на запрос отдают данные
//1 Вариант:
//    Сервис-ориетнитрованная архитектура (SOAP) Simple Object Access Protocol - ПРОТОКОЛ для передачи и обмена данными. SOAP работает поверх HTTP (в SOAP-е есть IP, TCP, сокеты и тд.)
//    HTTP - протокол, который позволяет передавать текст
//    SOAP - протокол, который передает определённый набор согласованных данных. Он имеет строгую структуру, и требует согласования с 2 сторон - на клиенте и на сервере и использует внутри себя структуру документа в виде xml. SOAP весит больше
//    То есть мы созадем не веб приложение, а Web Service - у веб сервиса может быть много разных клиентов (телфон, телевизор), а с веб приложением общается только браузер, потому что веб приложения отдают HTML.
//    Десктопные приложения могут отправлять HTTP запросы, а HTML ему попросту не нужен
//2 Вариант:
//    Rest - это уже не протокол, а архитектурный стиль. Так как мы все равно используем HTTP протокол, то зачем усложнять. Так как у нас есть понятие url, то зачем в Soap/xml впихивать ту точку, которую я хочу вызвать на сервере, когда я могу указать это в url.
//    Rest - это упрощение, это архитектурный стиль (это не протокол) который говорит, что давайте использовать обычные понятия, такие как HTTP(как протокол для передачи данных), URL(как идентификатор ресурсов, которые мы хотим вызвать на сервере) и XML/JSON(в качестве формата обмена данными)
//    В ресте:
//    Если мы знаем основной url + данные + метод (например Get()) - мы знаем все, что требуется для отправки HTTP запроса на сервер
//
//    Поэтому если мы говорим про HTTP и про REST, это не значит что это работа с браузером, потому что HTTP запрос можно отправить практически с любого языка программирования на другой язык программирования. HTTP позволяет предавать не только HTML, но и другие данные
//
//    API - набор каких-то открытых точек, куда мы можем отправить HTTP запрос и получить какие-то данные/все что открыто для взаимодействия
//
//    На самом деле для реализации API достаточно реализовать сервлеты без JSP (отправлять JSON)
//    Но если мы хотим построить на сервлетах Rest API, то нам надо добавить библиотеку для работы с JSON. Но мы так не делаем, так как у нас есть Spring
//
    //Postman, Insomnia - программы для тестирования наших методов API
    //В REST важен тип метода. В вэбе мы использовали 2 типа методов - get(), post(). В вэбе url очень много значит
    //Если мы напишем localhost:8080/user и будет указан тип метода - GET, то это значит, что мы хотим получить всех user-ов
    //Если мы напишем localhost:8080/user?id=2 и будет указан тип метода - GET, то это значит, что мы хотим получить 1 user-а с id = 2
    //Если мы напишем localhost:8080/user и будет указан тип метода - POST, то это значит, что мы хотим сохранить/создать user-а
    //Если мы напишем localhost:8080/user и будет указан тип метода - PUT, то это значит, что мы хотим обновить user-а
    //GET - получить
    //POST - создать, сохранить
    //PUT - обновить
    //DELETE - удалить
 //В классическом Spring надо добавить Jackson в конфигурацию и зарегистрировать его в качестве конвертера
    //Если мы пишем свой REST API, то он должен поддерживать несколько ограничений
    //И если мы соблюдаем все 5 ограничений - то наш REST - RESTFULL (полноценный)
    //В REST есть несколько ограничений:
    //Одно из них: нет состояний (нет такого понятия, как сессия). Мы не должны сохранять состояние определённого пользователя
}
