package tms;

public class Class {
    //Журналирование или логирование нужно для того, чтобы записывать какие-либо события, которые происходят во врем работы приложения
    //Логи можно собирать: в файле на сервере; отправка логов на другой доп. сторонний сервер; сохранение в бд
    //Библиотеки для логов: slf4j - это унифицированный интерфейс (спецификация)[имеет 5 уровней логирования], Apache log4j, Logback, (JDK Logging API)util.Logger
    //Уровень логирования - категория или вид или тип события, которое было записано. Благодаря уровням легче находить сообщения, которые нас интересуют
    //Уровни логирования(не все):DEBUG(нужен при разработке приложения, но не на сервере); INFO; ERROR
    //Разбираем модульное тестирование

    public int testMethod(int a, int b) {
        return a + b;
    }
}
