public class Class {
    //Thymeleaf(шаблонизатор в мире jsp):
//Посмотрим if, foreach, валидация
//Веб приложение - это mvc+шаблонизация (самый современный подход - SpringBoot+Thymeleaf)
//У саймвлива немного другая система подхода к шаблонизации (в основном все шаблонизаторы //используют свои типы файлов,
//в саймвлив - использует сразу html тип). -> Мы работаем с //обычными html страничками. + у нас нет экспрешн лэнгвич ->
//саймвлив встраивается в разметку под видом атрибутов со своим пространством имён. Все, что мы делаем в саймлив -
//по факту работаем с его атрибутами
//Атрибуты в html - это дополнительные значения, которые настраивают элементы или регулируют их поведение различным способом,
//чтобы соответствовать критериям пользователей
    //Таймлив не показывает все, что идет после ошибки
}
