public class Class {
    //Spring MVC(тоже самое, что и Spring Web) - отдельный модуль  Spring framework, который упрощает разработку приложений в вебе
    //Внутри Spring Web - находятся сервлеты
    //Помимо упрощения работы с вебом, добавлен Design Pattern (MVC - Model-View-Controller). Это больше архитектурный паттерн, который объясняет
    //о наличии 3-ёх абстрактных видах компонентов(фотка(Controller, Model, View)) и взаимодействия с ними. Этот паттерн внедрен в спринг веб
    //WebFlux - вариант реактивного стиля написания в спринге
    //Spring Web MVC - эволюция всего, что связано с сервлетами и веб EE
    //Dispatcher Servlet (фотка) - обычный сервлет. Для его работы полюбому понадобится какой-то application server/контейнер сервлетов
    //Поэтому надо подключать Tomcat
}
