public class FactoryMethodPattern {
//    Фабричный метод всегда возвращает новый instance(пример), когда просим,
//    но можно гибко настраивать то, что возварщает фабричный метод, в отличие от конструктора(тип возвр. знач.)

    private FactoryMethodPattern(){}

    //Если данные кэшируются, и в кэше уже есть такой объект, то возвращаем ссылку на данные из кэша
    public static FactoryMethodPattern getInstance(){
        //типо если передаваемое значение совпадает тут с кэшом, то возвращаем его, иначе создаем новое
        return new FactoryMethodPattern();
    }

}
