public class User {

    private volatile int a = 1;//потокобезопасная переменная
    // переменная не может быть кешои для какого-либо потока
    //как static для потоков

    public void sayHello() {
        synchronized (this) {
            //только 1 поток может выполнять операторы данной секции
            //this - это монитор(следить за тем, что написано выше)
            //Semaphore(нативно не реализован) - то же самое, что и монитор, но с определённым
            // дрступом (определнённое кол-во потоков может одновремменно использовать)
            System.out.println("Hello");
        }
    }

    public synchronized void sayHello1() { //весь метод -
        //критическая секция(доступ только у одного потока)
        System.out.println("Hello");
    }
}

